In [125]:
import pandas as pd
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [126]:
df=pd.DataFrame(people)#to convert a dicitonary into data frame

In [100]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df['email']#to access the column

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [6]:
type(df['email'])#gives data in series , series is a rows of single columns so here it will be of email column

pandas.core.series.Series

In [7]:
df.email#another notation

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [8]:
df[['email','first']]#to access multiple columns in sames command use a nested list

                     email  first
0  CoreyMSchafer@gmail.com  Corey
1        JaneDoe@email.com   Jane
2        JohnDoe@email.com   John

In [9]:
# iloc(integer location), allows us to access rows by integer location
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [10]:
df.iloc[[0,2]]#to access multiple rows

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com

In [11]:
df.iloc[[0,1],[0,2]]# by using the second parameter we can specify the columns which we need in output

   first                    email
0  Corey  CoreyMSchafer@gmail.com
1   Jane        JaneDoe@email.com

In [12]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [13]:
df.loc[[0],["first"]]

   first
0  Corey

In [15]:
df #the first columns is the index of the row which uniquely identifies that row

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Custom Index

In [17]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [19]:
df["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [26]:
df.set_index("email",inplace=True)#this will just make a copy and will change the index it won't get changed in the real database, 
# if we want to do it inplace we have to send as true as second parameter

KeyError: "None of ['email'] are in the columns"

In [27]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [30]:
df.index#to see the currently working index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [32]:
df.columns# the index column got removed from the list

Index(['first', 'last'], dtype='object')

In [36]:
df.loc['CoreyMSchafer@gmail.com','last']

'Schafer'

In [37]:
df.reset_index(inplace=True)#to re

In [38]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

# Filtering Data

In [51]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [69]:
# We want to get people with last name as doe

k=(df['last']=='Doe')
print(k)#gives us boolean mask

0    False
1     True
2     True
Name: last, dtype: bool

In [66]:
df[k]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [78]:
df.loc[k,'first']#we can use loc also, by using loc we can specify the columns we want

1    Jane
2    John
Name: first, dtype: object

In [80]:
#and(&) or(|) for filtering with condition

# we want rows where last name is doe and first name is john

filt=(df['last']=='Doe') & (df['first']=='John')
df.loc[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [84]:
#we want last=schafer or first=john

filt=(df['last']=='Schafer')|(df['first']=='John')
df.loc[filt]

#to get opposite
df.loc[~filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com

# Modifying data in rows and columns

In [85]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [86]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [99]:
#we want to update column name from first to firstname

df.columns=['first_name','last_name','email']# 1st way to update column name


#to uppercase all columns

In [100]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [105]:
df.columns=[x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [106]:
#replacing _ with space

df.columns=df.columns.str.replace(' ',"_")
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [109]:
#applying changes to only certain column
df.rename(columns={"first_name":"first","last_name":"last"},inplace=True)#pass the renames as dicitonary into df.rename function
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

## Updating data in rows

In [113]:
df.loc[2]=['John','Smith','johnsmith@email.com']#basic way but we have to pass every column value

In [114]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      johnsmith@email.com

In [123]:
df.loc[2,['last','email']]=['Doe','Johndoe@email.com']

In [124]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        Johndoe@email.com

In [125]:
df.loc[2,'last']='Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        Johndoe@email.com

In [126]:
df.at[2,'last']='Doe'#one more option
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        Johndoe@email.com

In [130]:
#change last name of person with email Johndoe@email.com

filt=(df["email"]=="Johndoe@email.com")
df.loc[filt,'last']='Smith'
df
df.loc[filt,['last','email']]=['Doe','JohnDoe@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

## Apply

In [137]:
# Updating multiple rows of data
df['email']=df['email'].str.lower()#we have to store again to make it permanent
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [156]:
#apply
#mainly used for manipulation complete rows or columns
#for series, can apply value to complete series

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [144]:
def updateEmail(email):
    return email.upper()

df['email']=df['email'].apply(updateEmail)#we can apply a funciton on all values
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John      Doe        JOHNDOE@EMAIL.COM

In [146]:
#using lamda fuction


df['email']=df['email'].apply(lambda x:x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [147]:
#apply on series

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [149]:
df.apply(len)#applying length function to each columns

first    3
last     3
email    3
dtype: int64

In [150]:
#min value in each column
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [152]:
#applymap(use for dataframe,on each individual value) or map
df.map(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [155]:
df.map(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [163]:
df['first'].map({'Corey':'Chris','Jane':'Mary'})
#we will get nan value for value not specified

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [164]:
df['first'].replace({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [1]:
df

NameError: name 'df' is not defined

# Adding or removing columns or rows

In [62]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [105]:
# we want to store first and last as first name column
df['full_name']=df['first']+" "+df['last']

In [106]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe
3   Tony      NaN                      NaN            NaN

In [107]:
# we want to remove first and last columns
df.drop(columns=['first','last'],inplace=True)

In [108]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe
3                      NaN            NaN

In [109]:
# we want to split full name column into first and last column

df['full_name'].str.split(" ")

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
3                 NaN
Name: full_name, dtype: object

In [110]:
df['full_name'].str.split(" ",expand=True)#by using expand method we can convert that list columns rows format

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3    NaN      NaN

In [111]:
df[['first','last']]=df['full_name'].str.split(" ",expand=True)

In [112]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN    NaN      NaN

In [113]:
#we want to add to new row
new_row=pd.DataFrame([{'first':'Tony'}])# we have to create a data frame
df=pd.concat([df,new_row],ignore_index=True) # then we have concatenate it into our dataframe object

In [114]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN    NaN      NaN
4                      NaN            NaN   Tony      NaN

In [93]:
people = {
    "first": ["Toney", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["IronMan@avenge.com", 'Cap@avg.com']
}

df2=pd.DataFrame(people)
df2

   first    last               email
0  Toney   Stark  IronMan@avenge.com
1  Steve  Rogers         Cap@avg.com

In [115]:
# we want to add our second dataframe into first

df=pd.concat([df,df2],ignore_index=True)

In [116]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN    NaN      NaN
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN  Toney    Stark
6              Cap@avg.com            NaN  Steve   Rogers

In [118]:
#deleting a row

df.drop([3],inplace=True)

In [119]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN  Toney    Stark
6              Cap@avg.com            NaN  Steve   Rogers

In [123]:
# we want to delete row with last name =doe
df.drop(index=df[df['last']=='Doe'].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN  Toney    Stark
6              Cap@avg.com            NaN  Steve   Rogers

In [124]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4                      NaN            NaN   Tony      NaN
5       IronMan@avenge.com            NaN  Toney    Stark
6              Cap@avg.com            NaN  Steve   Rogers

# Sorting data

In [129]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [131]:
df.sort_values(by='last',ascending=False)#sorting based on columns name

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [132]:
# to sort multiple columns
df.sort_values(by=['last','first'],ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com

In [133]:
new_row=pd.DataFrame([{'first':'Adam','last':'Doe','email':'A@email.com'}])# we have to create a data frame
df=pd.concat([df,new_row],ignore_index=True)

In [134]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [135]:
df.sort_values(by=['last','first'],ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [139]:
#first sort last name in descending order then in first in ascending order
df.sort_values(by=['last','first'],ascending=[False,True],inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [142]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [150]:
#to only get column after sorting
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object

In [ ]:
d

# Cleaning Data

In [25]:
import pandas as pd
import numpy as np
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [26]:
df=pd.DataFrame(people)
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [27]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [28]:
df.dropna(axis='index',how='all')#removes na values
#axis is to say that if see any row with na values we want it to be removed and for columns we will set it as columns
#how will remove rows with any missing values
#any=will remove rows with na values
#all will remove rows with complete na values

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [29]:
#deleting rows which have missing values in specific columns

df.dropna(axis='index',how='all',subset=['last','email'])#if both columns have missing values then we remove 
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [30]:
#removing custom missing values
#e.g NA, None
# to verify if a values are getting treated as na or not 
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [32]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [34]:
df.fillna('Missing')#replaces all na values with the parameter specified

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  Missing       36
4  Missing  Missing                  Missing  Missing
5  Missing  Missing      Anonymous@email.com  Missing
6  Missing  Missing                  Missing  Missing

In [36]:
df.fillna(0)#use inplace for permanent

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [37]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [38]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [39]:
#average age 
#now we can't find because values are string
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [43]:
#we need to typecast age
type(np.nan)#we have to use float when typecasting because nan is float inside python

float

In [42]:
df['age']=df['age'].astype(float)

In [45]:
df['age'].mean()

np.float64(46.75)